/* УРОК 23. СВОЙСТВО length */

/* length - ИСПОЛЬЗУЕТСЯ И ДЛЯ МАССИВА И ДЛЯ СТРОК: */

/*  ДЛЯ МАССИВА СЧИТАЕТ -  ЭЛЕМЕНТЫ:*/
// Пример: c массивом:
let fruits = ['Банан', 'Апельсин', 'Груша'];
console.log(fruits.length); //  3

/*  ДЛЯ СТРОКИ - СЧИТАЕТ СИМВОЛЫ: */
// Пример 1: со строками:
let name1 = 'Костя';
console.log(name1.length); // 5 
/* потому что в строке 5 символов:
К о с т я
1 2 3 4 5
*/


// ДЗ 24

// Задание 1 
let name = 'Оля'; // создали строку
console.log(name.length); // вывели ее длину // 3


// Задание 2  
let city = 'Osijek';
console.log(city.length); // 6


// Задание 3 
let colors = ['Красный', 'Синий', 'Зеленый']
console.log(colors.length);

